// <Summary>
// Первый шаг
// Любая, даже самая сложная дорога, начинается с первого шага.
// Выведите на консоль фразу The first step!
// Допишите код метода Main, а затем запустите и проверьте ваше решение с помощью кнопки «Отправить».
// Считайте, что инструкции using и namespace уже написаны за вас, осталось написать только тело метода.
// </Summary>

using System;
using System.Collections.Generic;
using System.Text;

namespace LecturePractice.Lecture1
{
    public class Task1
    {
        public static void Hello()
        {
            // пишите код тут
            System.Console.WriteLine("The first step!");
        }
    }
}
